app/controllers/post_controller.rb

INSERT INTO "posts" ("user_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["description", "post funziona"], ["created_at", "2018-06-16 11:07:48.000842"], ["updated_at", "2018-06-16 11:07:48.000842"]]
---
  def create
    description = params[:description]
    post = Post.create(user_id: current_user.id,description: description)