app/controllers/user_profile_controller.rb

  def show
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 8], ["LIMIT", 1]]